## Pandas

* Pandas use cases:
    * Data Transformation
    * Data Analysis
    * Data Cleaning
    
* Pandas Notations:
    * Series ----- Creating the data
    * DataFrame --- For Making the data in a particular tabular format

In [4]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':30,'s3':20}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    30
s3    20
dtype: int64

In [7]:
final={'Internal1':internal1,"Internal2":internal2}
final=pd.DataFrame(final)
final

    Internal1  Internal2
s1         20         10
s2         10         30
s3         30         20

In [14]:
final.columns

Index(['Internal1', 'Internal2'], dtype='object')

In [15]:
final.values

array([[20, 10],
       [10, 30],
       [30, 20]], dtype=int64)

In [16]:
final.values[2,0]

30

In [17]:
final.values[0,0]

20

In [18]:
final.values[2]

array([30, 20], dtype=int64)

In [19]:
for i in final.values:
    print(i[0],i[1])

20 10
10 30
30 20

In [20]:
for i in final.values:
    print(i[0])

20
10
30

In [22]:
final.loc['s4']=[20,30]

In [23]:
final

    Internal1  Internal2
s1         20         10
s2         10         30
s3         30         20
s4         20         30

In [24]:
final.drop('s4')

    Internal1  Internal2
s1         20         10
s2         10         30
s3         30         20

In [25]:
final.values[2]=[12,30]

In [26]:
final

    Internal1  Internal2
s1         20         10
s2         10         30
s3         12         30
s4         20         30

In [45]:
### Reading the csv files using Pandas:

import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [50]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [51]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [52]:
income.values[1][1]

'Alaska'

In [53]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [55]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [57]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933

* Average income of Alaska in all years
* Average income of all states in 2012
* Create a function to print all columns in a single line
* Create a function to access a row based on a unique column value
* Create a function to find average income of all states from 2005 to 2013
* Create a function to find the highest average income in the last three     years
* Create a function to find the lowest average income from 2007 to           2010(inclusive)
* Print the list of all states in the same line with average income less     than calfornia.
* Print the names of states based on descending order of their averages in   the year 2009
* State the lowest recorded income from 2005 to 2013